Console.Clear();

//Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).
Console.WriteLine("Введите число, чтобы получить его квадрат: ");
int n = Convert.ToInt32(Console.ReadLine());
Console.Write(n*n);

